Функция СформироватьТекстСообщенияПоШаблону(Шаблон, Получатель, Контекст) Экспорт
	
	ТекстСообщения = Шаблон.ШаблонСообщения;
	НачалоБлока = ?(Шаблон.ВариантФормата = "HTML", "{{ ", "<");
	КонецБлока = ?(Шаблон.ВариантФормата = "HTML", " }}", ">"); 
	
	Для Каждого ПолеШаблона Из Шаблон.ПоляШаблона Цикл
		Поле = НачалоБлока + ПолеШаблона.Поле + КонецБлока;
		Результат = "";
		Выполнить(ПолеШаблона.АлгоритмРасчета);
		ТекстСообщения = СтрЗаменить(ТекстСообщения, Поле, Результат);
	КонецЦикла;
	
	Возврат ТекстСообщения;
	
КонецФункции