#Область ОбработчикиСобытийФормы

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область ОбработчикиОповещений

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
//+бит_Сафаров ШИ 04.09.2026

#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Автовычисление положения нового состояния в контекстном меню журнала записи.
	Если Объект.Ссылка.Пустая()
		И Не ЗначениеЗаполнено(Объект.ПоложениеВЖурналеЗаписи) Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр(
			"ПоложениеВПодменю",
			Перечисления.ПоложениеСостоянияЗаявкиВЖурналеЗаписи.ВПодменю);
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		|\tВидыСостоянийЗаявок.Ссылка КАК Ссылка
		|ИЗ
		|\tСправочник.ВидыСостоянийЗаявок КАК ВидыСостоянийЗаявок
		|ГДЕ
		|\tВидыСостоянийЗаявок.ПоложениеВЖурналеЗаписи = &ПоложениеВПодменю";
		Если Запрос.Выполнить().Пустой() Тогда
			Объект.ПоложениеВЖурналеЗаписи =
				Перечисления.ПоложениеСостоянияЗаявкиВЖурналеЗаписи.ВОсновномСписке;
		Иначе
			Объект.ПоложениеВЖурналеЗаписи =
				Перечисления.ПоложениеСостоянияЗаявкиВЖурналеЗаписи.ВПодменю;
		КонецЕсли;
	ИначеЕсли Объект.ИмяПредопределенныхДанных = "Забронирована"
		Или Объект.ИмяПредопределенныхДанных = "СозданаНаСайте" Тогда
		Элементы.ПоложениеВЖурналеЗаписи.Видимость = Ложь;
	КонецЕсли;

	Если Параметры.Ключ.Пустая() Тогда
		ВыбранныйЦвет = УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ОсновнойЦветЗаявки");
	Иначе
		СправочникОбъект = ДанныеФормыВЗначение(Объект, Тип("СправочникОбъект.ВидыСостоянийЗаявок"));
		ВыбранныйЦвет = СправочникОбъект.Цвет.Получить();
	КонецЕсли;

	Элементы.Наименование.ТолькоПросмотр = Объект.Предопределенный;

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)

	ТекущийОбъект.Цвет = Новый ХранилищеЗначения(ВыбранныйЦвет);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	Оповестить("ВидСостояниеЗаявкиЗапись");

КонецПроцедуры

#КонецОбласти

//-бит_Сафаров ШИ 04.09.2026
